XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/ir_reg.h
    /* 0x8  reserved */
    uint8_t RESERVED0x8[8];

    /* 0x10 : irtx_pulse_width */
    union {
        struct {
            uint32_t cr_irtx_pw_unit   : 12; /* [11: 0],        r/w,      0x464 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t cr_irtx_mod_ph0_w : 8;  /* [23:16],        r/w,       0x11 */
            uint32_t cr_irtx_mod_ph1_w : 8;  /* [31:24],        r/w,       0x22 */
        } BF;
        uint32_t WORD;
    } irtx_pulse_width;

    /* 0x14 : irtx_pw_0 */
    union {
        struct {
            uint32_t cr_irtx_logic0_ph0_w : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t cr_irtx_logic0_ph1_w : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t cr_irtx_logic1_ph0_w : 8; /* [23:16],        r/w,        0x0 */
            uint32_t cr_irtx_logic1_ph1_w : 8; /* [31:24],        r/w,        0x2 */
        } BF;
        uint32_t WORD;
    } irtx_pw_0;

    /* 0x18 : irtx_pw_1 */
    union {
        struct {
            uint32_t cr_irtx_head_ph0_w : 8; /* [ 7: 0],        r/w,        0xf */
            uint32_t cr_irtx_head_ph1_w : 8; /* [15: 8],        r/w,        0x7 */
            uint32_t cr_irtx_tail_ph0_w : 8; /* [23:16],        r/w,        0x0 */
            uint32_t cr_irtx_tail_ph1_w : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } irtx_pw_1;

    /* 0x1c  reserved */
    uint8_t RESERVED0x1c[36];

    /* 0x40 : irrx_config */
    union {
        struct {
            uint32_t cr_irrx_en      : 1;  /* [    0],        r/w,        0x0 */
            uint32_t cr_irrx_in_inv  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t cr_irrx_mode    : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t cr_irrx_deg_en  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7    : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t cr_irrx_deg_cnt : 4;  /* [11: 8],        r/w,        0x0 */
            uint32_t reserved_12_31  : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } irrx_config;

    /* 0x44 : irrx_int_sts */
    union {
        struct {
            uint32_t irrx_end_int      : 1; /* [    0],          r,        0x0 */
            uint32_t irrx_frdy_int     : 1; /* [    1],          r,        0x0 */
            uint32_t irrx_fer_int      : 1; /* [    2],          r,        0x0 */
            uint32_t reserved_3_7      : 5; /* [ 7: 3],       rsvd,        0x0 */
            uint32_t cr_irrx_end_mask  : 1; /* [    8],        r/w,        0x1 */
            uint32_t cr_irrx_frdy_mask : 1; /* [    9],        r/w,        0x1 */
            uint32_t cr_irrx_fer_mask  : 1; /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_15    : 5; /* [15:11],       rsvd,        0x0 */
            uint32_t cr_irrx_end_clr   : 1; /* [   16],        w1c,        0x0 */
            uint32_t rsvd_17           : 1; /* [   17],       rsvd,        0x0 */
            uint32_t rsvd_18           : 1; /* [   18],       rsvd,        0x0 */
            uint32_t reserved_19_23    : 5; /* [23:19],       rsvd,        0x0 */
            uint32_t cr_irrx_end_en    : 1; /* [   24],        r/w,        0x1 */
            uint32_t cr_irrx_frdy_en   : 1; /* [   25],        r/w,        0x1 */
            uint32_t cr_irrx_fer_en    : 1; /* [   26],        r/w,        0x1 */
            uint32_t reserved_27_31    : 5; /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } irrx_int_sts;

    /* 0x48 : irrx_pw_config */
    union {
        struct {
            uint32_t cr_irrx_data_th : 16; /* [15: 0],        r/w,      0xd47 */
            uint32_t cr_irrx_end_th  : 16; /* [31:16],        r/w,     0x2327 */
        } BF;
        uint32_t WORD;
    } irrx_pw_config;

    /* 0x4c  reserved */
    uint8_t RESERVED0x4c[4];

    /* 0x50 : irrx_data_count */
    union {
        struct {
            uint32_t sts_irrx_data_cnt : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t reserved_7_31     : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } irrx_data_count;

    /* 0x54 : irrx_data_word0 */
    union {
        struct {
            uint32_t sts_irrx_data_word0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } irrx_data_word0;

    /* 0x58 : irrx_data_word1 */
    union {
        struct {
            uint32_t sts_irrx_data_word1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } irrx_data_word1;

    /* 0x5c  reserved */
    uint8_t RESERVED0x5c[36];

    /* 0x80 : irtx_fifo_config_0 */
    union {
        struct {
            uint32_t irtx_dma_en       : 1;  /* [    0],        r/w,        0x0 */
            uint32_t rsvd_1            : 1;  /* [    1],       rsvd,        0x0 */
            uint32_t tx_fifo_clr       : 1;  /* [    2],        w1c,        0x0 */
            uint32_t rx_fifo_clr       : 1;  /* [    3],        w1c,        0x0 */
            uint32_t tx_fifo_overflow  : 1;  /* [    4],          r,        0x0 */
            uint32_t tx_fifo_underflow : 1;  /* [    5],          r,        0x0 */
            uint32_t rx_fifo_overflow  : 1;  /* [    6],          r,        0x0 */
            uint32_t rx_fifo_underflow : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } irtx_fifo_config_0;

    /* 0x84 : irtx_fifo_config_1 */
    union {
        struct {
            uint32_t tx_fifo_cnt    : 3; /* [ 2: 0],          r,        0x4 */
            uint32_t reserved_3_7   : 5; /* [ 7: 3],       rsvd,        0x0 */
            uint32_t rx_fifo_cnt    : 7; /* [14: 8],          r,        0x0 */
            uint32_t reserved_15    : 1; /* [   15],       rsvd,        0x0 */
            uint32_t tx_fifo_th     : 2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_23 : 6; /* [23:18],       rsvd,        0x0 */
            uint32_t rx_fifo_th     : 6; /* [29:24],        r/w,        0x0 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } irtx_fifo_config_1;

    /* 0x88 : ir_fifo_wdata */
    union {
        struct {
            uint32_t tx_fifo_wdata : 32; /* [31: 0],          w,        0x0 */
        } BF;
        uint32_t WORD;
    } ir_fifo_wdata;

    /* 0x8C : ir_fifo_rdata */
    union {
        struct {
            uint32_t rx_fifo_rdata  : 16; /* [15: 0],          r,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ir_fifo_rdata;
};

typedef volatile struct ir_reg ir_reg_t;

#endif /* __IR_REG_H__ */
